contiki-os/contiki/cc26xxware/inc/hw_aux_wuc.h
// Field: [5]    TDC
//
// Enables (1) or disables (0) clock for AUX_TDCIF.
//
// Note that the TDC counter and reference clock sources must be requested
// separately using TDCCLKCTL and REFCLKCTL, respectively.
// ENUMs:
// DIS                  System CPU has not requested clock for TDC
// EN                   System CPU has requested clock for TDC
//
#define AUX_WUC_MODCLKEN0_TDC                                       0x00000020
#define AUX_WUC_MODCLKEN0_TDC_BITN                                  5
#define AUX_WUC_MODCLKEN0_TDC_M                                     0x00000020
#define AUX_WUC_MODCLKEN0_TDC_S                                     5
#define AUX_WUC_MODCLKEN0_TDC_DIS                                   0x00000000
#define AUX_WUC_MODCLKEN0_TDC_EN                                    0x00000020

// Field: [4]    SOC
//
// Enables (1) or disables (0) clock for AUX_SOC.
//
// Note that the ADC internal clock must be requested separately using
// ADCCLKCTL.
// ENUMs:
// DIS                  System CPU has not requested clock for SOC
// EN                   System CPU has requested clock for SOC
//
#define AUX_WUC_MODCLKEN0_SOC                                       0x00000010
#define AUX_WUC_MODCLKEN0_SOC_BITN                                  4
#define AUX_WUC_MODCLKEN0_SOC_M                                     0x00000010
#define AUX_WUC_MODCLKEN0_SOC_S                                     4
#define AUX_WUC_MODCLKEN0_SOC_DIS                                   0x00000000
#define AUX_WUC_MODCLKEN0_SOC_EN                                    0x00000010

// Field: [3]    TIMER
//
// Enables (1) or disables (0) clock for AUX_TIMER.
// ENUMs:
// DIS                  System CPU has not requested clock for TIMER
// EN                   System CPU has requested clock for TIMER
//
#define AUX_WUC_MODCLKEN0_TIMER                                     0x00000008
#define AUX_WUC_MODCLKEN0_TIMER_BITN                                3
#define AUX_WUC_MODCLKEN0_TIMER_M                                   0x00000008
#define AUX_WUC_MODCLKEN0_TIMER_S                                   3
#define AUX_WUC_MODCLKEN0_TIMER_DIS                                 0x00000000
#define AUX_WUC_MODCLKEN0_TIMER_EN                                  0x00000008

// Field: [2]    AIODIO1
//
// Enables (1) or disables (0) clock for AUX_AIODIO1.
// ENUMs:
// DIS                  System CPU has not requested clock for AIODIO1
// EN                   System CPU has requested clock for AIODIO1
//
#define AUX_WUC_MODCLKEN0_AIODIO1                                   0x00000004
#define AUX_WUC_MODCLKEN0_AIODIO1_BITN                              2
#define AUX_WUC_MODCLKEN0_AIODIO1_M                                 0x00000004
#define AUX_WUC_MODCLKEN0_AIODIO1_S                                 2
#define AUX_WUC_MODCLKEN0_AIODIO1_DIS                               0x00000000
#define AUX_WUC_MODCLKEN0_AIODIO1_EN                                0x00000004

// Field: [1]    AIODIO0
//
// Enables (1) or disables (0) clock for AUX_AIODIO0.
// ENUMs:
// DIS                  System CPU has not requested clock for AIODIO0
// EN                   System CPU has requested clock for AIODIO0
//
#define AUX_WUC_MODCLKEN0_AIODIO0                                   0x00000002
#define AUX_WUC_MODCLKEN0_AIODIO0_BITN                              1
#define AUX_WUC_MODCLKEN0_AIODIO0_M                                 0x00000002
#define AUX_WUC_MODCLKEN0_AIODIO0_S                                 1
#define AUX_WUC_MODCLKEN0_AIODIO0_DIS                               0x00000000
#define AUX_WUC_MODCLKEN0_AIODIO0_EN                                0x00000002

// Field: [0]    SMPH
//
// Enables (1) or disables (0) clock for AUX_SMPH.
// ENUMs:
// DIS                  System CPU has not requested clock for SMPH
// EN                   System CPU has requested clock for SMPH
//
#define AUX_WUC_MODCLKEN0_SMPH                                      0x00000001
#define AUX_WUC_MODCLKEN0_SMPH_BITN                                 0
#define AUX_WUC_MODCLKEN0_SMPH_M                                    0x00000001
#define AUX_WUC_MODCLKEN0_SMPH_S                                    0
#define AUX_WUC_MODCLKEN0_SMPH_DIS                                  0x00000000
#define AUX_WUC_MODCLKEN0_SMPH_EN                                   0x00000001

//*****************************************************************************
//
// Register: AUX_WUC_O_PWROFFREQ
//
//*****************************************************************************
// Field: [0]    REQ
//
// Power off request
//
// 0: No action
// 1: Request to power down AUX. Once set, this bit shall not be cleared. The
// bit will be reset again when AUX is powered up again.
//
// The request will only happen if AONCTLSTAT.AUX_FORCE_ON = 0 and
// MCUBUSSTAT.DISCONNECTED=1.
#define AUX_WUC_PWROFFREQ_REQ                                       0x00000001
#define AUX_WUC_PWROFFREQ_REQ_BITN                                  0
#define AUX_WUC_PWROFFREQ_REQ_M                                     0x00000001
#define AUX_WUC_PWROFFREQ_REQ_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_PWRDWNREQ
//
//*****************************************************************************
// Field: [0]    REQ
//
// Power down request
//
// 0: Request for system to be in active mode
// 1: Request for system to be in power down mode
//
// When REQ is 1 one shall assume that the system is in power down, and that
// current supply is limited. When setting REQ = 0, one shall assume that the
// system is in power down until  PWRDWNACK.ACK = 0
#define AUX_WUC_PWRDWNREQ_REQ                                       0x00000001
#define AUX_WUC_PWRDWNREQ_REQ_BITN                                  0
#define AUX_WUC_PWRDWNREQ_REQ_M                                     0x00000001
#define AUX_WUC_PWRDWNREQ_REQ_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_PWRDWNACK
//
//*****************************************************************************
// Field: [0]    ACK
//
// Power down acknowledgment. Indicates whether the power down request given by
// PWRDWNREQ.REQ is captured by the AON domain or not
//
// 0: AUX can assume that the system is in active mode
// 1: The request for power down is acknowledged and the AUX must act like the
// system is in power down mode and power supply is limited
//
// The system CPU cannot use this bit since the bus bridge between MCU domain
// and AUX domain is always disconnected when this bit is set. For AUX_SCE use only
#define AUX_WUC_PWRDWNACK_ACK                                       0x00000001
#define AUX_WUC_PWRDWNACK_ACK_BITN                                  0
#define AUX_WUC_PWRDWNACK_ACK_M                                     0x00000001
#define AUX_WUC_PWRDWNACK_ACK_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_CLKLFREQ
//
//*****************************************************************************
// Field: [0]    REQ
//
// Low frequency request
//
// 0: Request clock frequency to be controlled by AON_WUC:AUXCLK and the
// system state
// 1: Request low frequency clock SCLK_LF as the clock source for AUX
//
// This bit must not be modified unless CLKLFACK.ACK matches the current value
#define AUX_WUC_CLKLFREQ_REQ                                        0x00000001
#define AUX_WUC_CLKLFREQ_REQ_BITN                                   0
#define AUX_WUC_CLKLFREQ_REQ_M                                      0x00000001
#define AUX_WUC_CLKLFREQ_REQ_S                                      0

//*****************************************************************************
//
// Register: AUX_WUC_O_CLKLFACK
//
//*****************************************************************************
// Field: [0]    ACK
//
// Acknowledgment of CLKLFREQ.REQ
//
// 0: Acknowledgement that clock frequency is controlled by AON_WUC:AUXCLK
// and the system state
// 1: Acknowledgement that the low frequency clock SCLK_LF is the clock source
// for AUX
//
#define AUX_WUC_CLKLFACK_ACK                                        0x00000001
#define AUX_WUC_CLKLFACK_ACK_BITN                                   0
#define AUX_WUC_CLKLFACK_ACK_M                                      0x00000001
#define AUX_WUC_CLKLFACK_ACK_S                                      0

//*****************************************************************************
//
// Register: AUX_WUC_O_BGAPREQ
//
//*****************************************************************************
// Field: [0]    REQ
//
// AUX_SCE request for band gap reference.
//
// 0: AUX_SCE does not need band gap enabled
// 1: AUX_SCE needs band gap to be enabled
//
// This bit must not be modified unless GBIASACK.ACK matches the current value
#define AUX_WUC_BGAPREQ_REQ                                         0x00000001
#define AUX_WUC_BGAPREQ_REQ_BITN                                    0
#define AUX_WUC_BGAPREQ_REQ_M                                       0x00000001
#define AUX_WUC_BGAPREQ_REQ_S                                       0

//*****************************************************************************
//
// Register: AUX_WUC_O_BGAPACK
//
//*****************************************************************************
// Field: [0]    ACK
//
// Acknowledgment of AUX_SCE band gap reference request.
//
// 0: Band gap request given in BGAPREQ.REQ is not captured by AON domain.
// State of band gap is given by system state
// 1: Band gap request given in BGAPREQ.REQ is captured by AON domain. Band
// gap is enabled
//
#define AUX_WUC_BGAPACK_ACK                                         0x00000001
#define AUX_WUC_BGAPACK_ACK_BITN                                    0
#define AUX_WUC_BGAPACK_ACK_M                                       0x00000001
#define AUX_WUC_BGAPACK_ACK_S                                       0

//*****************************************************************************
//
// Register: AUX_WUC_O_WUEVFLAGS
//
//*****************************************************************************
// Field: [2]    AON_RTC_CH2
//
// Indicates pending event from AON_RTC_CH2 compare. Note that this flag will be
// set whenever the AON_RTC_CH2 event happens, but that does not mean that this
// event is a wake-up event. To make the AON_RTC_CH2 a wake-up event for the AUX
// domain configure it as a wake-up event in AON_EVENT:AUXWUSEL.WU0_EV,
// AON_EVENT:AUXWUSEL.WU1_EV or AON_EVENT:AUXWUSEL.WU2_EV.
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2                               0x00000004
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_BITN                          2
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_M                             0x00000004
#define AUX_WUC_WUEVFLAGS_AON_RTC_CH2_S                             2

// Field: [1]    AON_SW
//
// Indicates pending event triggered by system CPU writing a 1 to
// AON_WUC:AUXCTL.SWEV.
//
#define AUX_WUC_WUEVFLAGS_AON_SW                                    0x00000002
#define AUX_WUC_WUEVFLAGS_AON_SW_BITN                               1
#define AUX_WUC_WUEVFLAGS_AON_SW_M                                  0x00000002
#define AUX_WUC_WUEVFLAGS_AON_SW_S                                  1

// Field: [0]    AON_PROG_WU
//
// Indicates pending event triggered by the sources selected in
// AON_EVENT:AUXWUSEL.WU0_EV, AON_EVENT:AUXWUSEL.WU1_EV and
// AON_EVENT:AUXWUSEL.WU2_EV.
//
#define AUX_WUC_WUEVFLAGS_AON_PROG_WU                               0x00000001
#define AUX_WUC_WUEVFLAGS_AON_PROG_WU_BITN                          0
#define AUX_WUC_WUEVFLAGS_AON_PROG_WU_M                             0x00000001
#define AUX_WUC_WUEVFLAGS_AON_PROG_WU_S                             0

//*****************************************************************************
//
// Register: AUX_WUC_O_WUEVCLR
//
//*****************************************************************************
// Field: [2]    AON_RTC_CH2
//
// Set to clear the WUEVFLAGS.AON_RTC_CH2 wake-up event. Note that if RTC channel
// 2 is also set as source for AON_PROG_WU this field can also clear
// WUEVFLAGS.AON_PROG_WU
//
// This bit must remain set until WUEVFLAGS.AON_RTC_CH2 returns to 0.
#define AUX_WUC_WUEVCLR_AON_RTC_CH2                                 0x00000004
#define AUX_WUC_WUEVCLR_AON_RTC_CH2_BITN                            2
#define AUX_WUC_WUEVCLR_AON_RTC_CH2_M                               0x00000004
#define AUX_WUC_WUEVCLR_AON_RTC_CH2_S                               2

// Field: [1]    AON_SW
//
// Set to clear the WUEVFLAGS.AON_SW wake-up event.
//
// This bit must remain set until WUEVFLAGS.AON_SW returns to 0.
#define AUX_WUC_WUEVCLR_AON_SW                                      0x00000002
#define AUX_WUC_WUEVCLR_AON_SW_BITN                                 1
#define AUX_WUC_WUEVCLR_AON_SW_M                                    0x00000002
#define AUX_WUC_WUEVCLR_AON_SW_S                                    1

// Field: [0]    AON_PROG_WU
//
// Set to clear the WUEVFLAGS.AON_PROG_WU wake-up event. Note only if an IO event
// is selected as wake-up event, is it possible to use this field to clear the
// source. Other sources cannot be cleared using this field.
//
// The IO pin needs to be assigned to AUX in the IOC and the input enable for
// the pin needs to be set in AIODIO0 or AIODIO1 for this clearing to take effect.
//
// This bit must remain set until WUEVFLAGS.AON_PROG_WU returns to 0.
#define AUX_WUC_WUEVCLR_AON_PROG_WU                                 0x00000001
#define AUX_WUC_WUEVCLR_AON_PROG_WU_BITN                            0
#define AUX_WUC_WUEVCLR_AON_PROG_WU_M                               0x00000001
#define AUX_WUC_WUEVCLR_AON_PROG_WU_S                               0

//*****************************************************************************
//
// Register: AUX_WUC_O_ADCCLKCTL
//
//*****************************************************************************
// Field: [1]    ACK
//
// Acknowledges the last value written to REQ.
//
#define AUX_WUC_ADCCLKCTL_ACK                                       0x00000002
#define AUX_WUC_ADCCLKCTL_ACK_BITN                                  1
#define AUX_WUC_ADCCLKCTL_ACK_M                                     0x00000002
#define AUX_WUC_ADCCLKCTL_ACK_S                                     1

