contiki-os/contiki/cc26xxware/inc/hw_aux_wuc.h
// Field: [0]    REQ
//
// Enables(1) or disables (0) the ADC internal clock.
//
// This bit must not be modified unless ACK matches the current value.
//
#define AUX_WUC_ADCCLKCTL_REQ                                       0x00000001
#define AUX_WUC_ADCCLKCTL_REQ_BITN                                  0
#define AUX_WUC_ADCCLKCTL_REQ_M                                     0x00000001
#define AUX_WUC_ADCCLKCTL_REQ_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_TDCCLKCTL
//
//*****************************************************************************
// Field: [1]    ACK
//
// Acknowledges the last value written to REQ.
#define AUX_WUC_TDCCLKCTL_ACK                                       0x00000002
#define AUX_WUC_TDCCLKCTL_ACK_BITN                                  1
#define AUX_WUC_TDCCLKCTL_ACK_M                                     0x00000002
#define AUX_WUC_TDCCLKCTL_ACK_S                                     1

// Field: [0]    REQ
//
// Enables(1) or disables (0) the TDC counter clock source.
//
// This bit must not be modified unless ACK matches the current value.
#define AUX_WUC_TDCCLKCTL_REQ                                       0x00000001
#define AUX_WUC_TDCCLKCTL_REQ_BITN                                  0
#define AUX_WUC_TDCCLKCTL_REQ_M                                     0x00000001
#define AUX_WUC_TDCCLKCTL_REQ_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_REFCLKCTL
//
//*****************************************************************************
// Field: [1]    ACK
//
// Acknowledges the last value written to REQ.
#define AUX_WUC_REFCLKCTL_ACK                                       0x00000002
#define AUX_WUC_REFCLKCTL_ACK_BITN                                  1
#define AUX_WUC_REFCLKCTL_ACK_M                                     0x00000002
#define AUX_WUC_REFCLKCTL_ACK_S                                     1

// Field: [0]    REQ
//
// Enables(1) or disables (0) the TDC reference clock source.
//
// This bit must not be modified unless ACK matches the current value.
#define AUX_WUC_REFCLKCTL_REQ                                       0x00000001
#define AUX_WUC_REFCLKCTL_REQ_BITN                                  0
#define AUX_WUC_REFCLKCTL_REQ_M                                     0x00000001
#define AUX_WUC_REFCLKCTL_REQ_S                                     0

//*****************************************************************************
//
// Register: AUX_WUC_O_RTCSUBSECINC0
//
//*****************************************************************************
// Field: [15:0] INC15_0
//
// Bits 15:0 of the RTC sub-second increment value.
#define AUX_WUC_RTCSUBSECINC0_INC15_0_M                             0x0000FFFF
#define AUX_WUC_RTCSUBSECINC0_INC15_0_S                             0

//*****************************************************************************
//
// Register: AUX_WUC_O_RTCSUBSECINC1
//
//*****************************************************************************
// Field: [7:0] INC23_16
//
// Bits 23:16 of the RTC sub-second increment value.
#define AUX_WUC_RTCSUBSECINC1_INC23_16_M                            0x000000FF
#define AUX_WUC_RTCSUBSECINC1_INC23_16_S                            0

//*****************************************************************************
//
// Register: AUX_WUC_O_RTCSUBSECINCCTL
//
//*****************************************************************************
// Field: [1]    UPD_ACK
//
// Acknowledgment of the UPD_REQ.
//
#define AUX_WUC_RTCSUBSECINCCTL_UPD_ACK                             0x00000002
#define AUX_WUC_RTCSUBSECINCCTL_UPD_ACK_BITN                        1
#define AUX_WUC_RTCSUBSECINCCTL_UPD_ACK_M                           0x00000002
#define AUX_WUC_RTCSUBSECINCCTL_UPD_ACK_S                           1

// Field: [0]    UPD_REQ
//
// Signal that a new real time counter sub second increment value is available
//
// 0: New sub second increment is not available
// 1: New sub second increment is available
//
// This bit must not be modified unless UPD_ACK matches the current value.
#define AUX_WUC_RTCSUBSECINCCTL_UPD_REQ                             0x00000001
#define AUX_WUC_RTCSUBSECINCCTL_UPD_REQ_BITN                        0
#define AUX_WUC_RTCSUBSECINCCTL_UPD_REQ_M                           0x00000001
#define AUX_WUC_RTCSUBSECINCCTL_UPD_REQ_S                           0

//*****************************************************************************
//
// Register: AUX_WUC_O_MCUBUSCTL
//
//*****************************************************************************
// Field: [0]    DISCONNECT_REQ
//
// Requests the AUX domain bus to be disconnected from the MCU domain bus. The
// request has no effect when AON_WUC:AUX_CTL.AUX_FORCE_ON is set.
//
// The disconnection status can be monitored through MCUBUSSTAT. Note
// however that this register cannot be read by the system CPU while disconnected.
//
// It is recommended that this bit is set and remains set after initial
// power-up, and that the system CPU uses AON_WUC:AUX_CTL.AUX_FORCE_ON to
// connect/disconnect the bus.
#define AUX_WUC_MCUBUSCTL_DISCONNECT_REQ                            0x00000001
#define AUX_WUC_MCUBUSCTL_DISCONNECT_REQ_BITN                       0
#define AUX_WUC_MCUBUSCTL_DISCONNECT_REQ_M                          0x00000001
#define AUX_WUC_MCUBUSCTL_DISCONNECT_REQ_S                          0

//*****************************************************************************
//
// Register: AUX_WUC_O_MCUBUSSTAT
//
//*****************************************************************************
// Field: [1]    DISCONNECTED
//
// Indicates whether the AUX domain and MCU domain buses are currently disconnected
// (1) or connected (0).
#define AUX_WUC_MCUBUSSTAT_DISCONNECTED                             0x00000002
#define AUX_WUC_MCUBUSSTAT_DISCONNECTED_BITN                        1
#define AUX_WUC_MCUBUSSTAT_DISCONNECTED_M                           0x00000002
#define AUX_WUC_MCUBUSSTAT_DISCONNECTED_S                           1

